app/Http/Services/MessageService.php

select * from `registers` where `registers`.`organization_id` = 11 and `registers`.`organization_id` is not null and (`fiscal_year` = '2025 - 2026') limit 1
insert into `messages` (`user_id`, `organization_id`, `message_type_id`, `status`, `uuid`, `remarks`, `forward_id`, `subject`, `urgency`, `updated_at`, `created_at`) values (30, 11, '1', 'sent', '932beced-1899-4986-8632-fb6dda909218', 'test', null, 'test', 'gray', '2025-05-21 09:46:14', '2025-05-21 09:46:14')
---
    public function create($data, $type, $is_record = false)
    {

        //Get the register number of the org
        $register = auth()->user()->organization->getRoot()->registers()->firstOrCreate(
            ['fiscal_year'=>fiscalYear()],
            ['incoming_no'=>0, 'outgoing_no'=>0]
        );


        //Incoming register saved if data is registered from incoming register record
        $incoming = $data['record']['incoming_no'] ?? $register->incoming_no + 1;

        //dd($data, $type, $record);
        $data = $this->getData($data, $type, $is_record);

        //dd($data['message']);
        $message = Message::create($data['message']);

select * from `users` where `users`.`id` = '20' and `users`.`deleted_at` is null limit 1
select * from `registers` where `registers`.`organization_id` = 1 and `registers`.`organization_id` is not null and (`fiscal_year` = '2025 - 2026') limit 1
update `registers` set `incoming_no` = `incoming_no` + 1, `registers`.`updated_at` = '2025-05-21 09:46:14' where `id` = 54
select * from `recipients` where `recipients`.`message_id` = 324660 and `recipients`.`message_id` is not null and (`organization_id` = 1 and `last_read` is null and `incoming_no` = 72 and `user_id` = '20') limit 1
insert into `recipients` (`organization_id`, `last_read`, `incoming_no`, `user_id`, `message_id`, `updated_at`, `created_at`) values (1, null, 72, '20', 324660, '2025-05-21 09:46:14', '2025-05-21 09:46:14')
---
    public function addRecipients($message, $userId)
    {
        $userIds = is_array($userId) ? array_unique($userId) : array($userId);

        collect($userIds)->each(function ($userId) use($message)
        {
            $senderFullOrg      = auth()->user()->organization->fullOrganization()->pluck('id')->toArray();
            $recipientRootOrg   = User::findOrFail($userId)->organization;

            //Check if recipient is within my org
            if(in_array($recipientRootOrg->id,$senderFullOrg))
            {
                $incoming_register = null;
            }
            //update incoming register when recipient is outside my org
            elseif($message->status === 'sent')
            {
                //Get the register of the org
                $register = $recipientRootOrg->registers()->firstOrCreate(
                    ['fiscal_year'=>fiscalYear()],
                    ['incoming_no'=>0, 'outgoing_no'=>0]
                );

                $incoming_register = $register->incoming_no + 1;

                $register->increment('incoming_no');
            }

            $data = [
                'organization_id'   => User::findOrFail($userId)->works_at,
                'last_read'         => $userId === auth()->id() ? new Carbon() : null,
                'incoming_no'       => $incoming_register ?? null,
                'user_id'           => $userId,
            ];
            $message->recipients()->firstOrCreate($data);
        });

insert into `recipients` (`is_user`, `organization_id`, `last_read`, `incoming_no`, `user_id`, `contact_id`, `message_id`, `updated_at`, `created_at`) values (0, null, null, null, null, '13', 324660, '2025-05-21 09:46:14', '2025-05-21 09:46:14')
---
    public function addContactRecipients($message, $userIds)
    {
        foreach($userIds as $user)
        {
            $data = [
                'is_user'           => false,
                'organization_id'   => null,
                'last_read'         => null,
                'incoming_no'       => null,
                'user_id'           => null,
                'contact_id'        => $user,
            ];

            $message->recipients()->firstOrCreate($data);