app/Http/Services/RecordService.php

select * from `users` where `users`.`id` = 20 limit 1
select * from `registers` where `registers`.`organization_id` = 11 and `registers`.`organization_id` is not null and (`fiscal_year` = '2025 - 2026') limit 1
insert into `records` (`dispatched_date`, `received_date`, `fiscal_year`, `outgoing_word`, `outgoing_no`, `mode`, `language`, `message_id`, `updated_at`, `created_at`) values ('2025-05-21 09:44:45', '2025-05-21 09:46:14', '2025 - 2026', null, 53, 'ལག་ཏུ་བསྐུར།', 'བོད་ཡིག།', 324660, '2025-05-21 09:46:14', '2025-05-21 09:46:14')
update `registers` set `outgoing_no` = `outgoing_no` + 1, `registers`.`updated_at` = '2025-05-21 09:46:14' where `id` = 60
---
    public function create($message, $record, $type, $is_record = false) : void
    {
        $recipients = $message->recipients;
        $recipientOrgs = array();
        foreach($recipients as $recipient)
        {
            if($recipient->is_user)
            {
                $recipientOrgs[] = $recipient->user->works_at;
            }
        }

        $makeRecord = $this->makeRecord($message, $recipientOrgs, $type) || $is_record;

        if($makeRecord)
        {
            //Get the register number of the org
            $register = auth()->user()->organization->getRoot()->registers()->firstOrCreate(
                ['fiscal_year'=>fiscalYear()],
                ['incoming_no'=>0, 'outgoing_no'=>0]
            );
            $outgoing_no = $record['old_outgoing_no'] ?? $register->outgoing_no + 1;

            $message->record()->create([
                'dispatched_date'   => isset($record['dispatched_date']) ? Carbon::parse($record['dispatched_date']) : Carbon::now(),
                'received_date'     => isset($record['received_date']) ? Carbon::parse($record['received_date']) : Carbon::now(),
                'fiscal_year'       => fiscalYear(),
                'outgoing_word'     => $record['letter_number'] ? $record['letter_number'] : null,
                'outgoing_no'       => $outgoing_no,
                'mode'              => $record['mode'] ?? 'སྒྲིག་འཛུགས་ནང་ཁུལ།',
                'language'          => $record['language'] ?? 'བོད་ཡིག',
            ]);

            if($type === 'outgoing' && $message->status === 'sent') // could be draft
            {
                $register->increment('outgoing_no');