app/Listeners/LogSuccessfulLogout.php

insert into `user_activities` (`user_id`, `ip_address`, `activity`, `updated_at`, `created_at`) values (1, '127.0.0.1', 'logout', '2025-05-21 10:53:09', '2025-05-21 10:53:09')
---
    public function handle(Logout $event)
    {
        // dd($event->user->name, Carbon::now(), request()->ip());
        $activity = new UserActivity;
        $activity->user_id = $event->user->id;
        $activity->ip_address = request()->ip();
        $activity->activity = 'logout';
        $activity->save();