app/Http/Livewire/FolderStatus.php

select `folders`.*, `folder_message`.`message_id` as `pivot_message_id`, `folder_message`.`folder_id` as `pivot_folder_id`, `folder_message`.`created_at` as `pivot_created_at`, `folder_message`.`updated_at` as `pivot_updated_at` from `folders` inner join `folder_message` on `folders`.`id` = `folder_message`.`folder_id` where `folder_message`.`message_id` = 2 and 0 = 1
---
    public function render()
    {
        $folders = $this->message->folders()->whereIn('folder_id',$this->folderArr)->get();