app/Http/Livewire/MessageTable.php

    public function render()
    {
        $query = match ($this->type) {
            'inbox' => Message::forUser(),
            'sent' => Message::sentByUser(),
            'draft' => Message::myDraft(),
        };


        $messages = $query->whereLike(['subject', 'remarks', 'sender.name', 'contactSender.name'], $this->search ?? '')
            ->with(['type', 'sender', 'prevPullBack', 'recipients.user', 'contactSender'])
            ->withCount('attachments')
            ->paginate(15);

        $orgs = OrganizationHierarchy::fullOrganization()->pluck('id')->toArray();
        $orgsFolder = Folder::whereIn('organization_id', $orgs)->pluck('id')->toArray();
---
select * from `recipients` where `recipients`.`message_id` in (324443, 324450, 324458, 324464, 324471, 324476, 324485, 324492, 324502, 324507, 324509, 324517, 324536, 324542, 324610)
select * from `users` where `users`.`id` in (169, 187, 188)
select `id` from `folders` where `organization_id` in (188, 189, 190, 192, 193, 194, 195, 214, 253, 343, 403, 11)