app/Http/Livewire/RecordTable.php

select `id`, `name_tibetan` from `message_type`
---
    public function mount($type)
    {
        $this->showAccess = false;
        $this->type = $type;
        $this->msg_types = MessageType::select('id', 'name_tibetan')->get();

select `messages`.`is_user`, `messages`.`user_id`, `messages`.`contact_id` from `messages` where `messages`.`organization_id` not in (188, 189, 190, 192, 193, 194, 195, 214, 253, 343, 403, 11) and exists (select * from `recipients` where `messages`.`id` = `recipients`.`message_id` and `organization_id` in (188, 189, 190, 192, 193, 194, 195, 214, 253, 343, 403, 11)) and `status` = 'sent'
select * from `recipients` where `recipients`.`message_id` in (324464, 324471, 324476, 324485, 324492, 324502, 324507, 324509, 324517, 324536, 324542, 324610)
---
         */

        if ($this->type === 'incoming') {
            $incomingMessages  = Message::with(['sender', 'contactSender'])
                ->whereNotIn('messages.organization_id', $myOrgs)
                ->whereHas('recipients', function ($query) use ($myOrgs) {
                    $query->whereIn('organization_id', $myOrgs);
                })
                ->where('status', 'sent')
                ->select('messages.is_user', 'messages.user_id', 'messages.contact_id')
                ->get();

select * from `users` where `users`.`id` in (4, 11, 19, 20, 21, 22, 23, 24, 25, 26, 27, 31, 32, 33, 34, 35, 45, 53, 54, 59, 68, 110, 114, 115, 116, 117, 118, 121, 122, 123, 138, 139, 140, 142, 143, 144, 145, 155, 156, 157, 166, 169, 171, 172, 176, 183, 186, 187, 188, 190, 198, 199, 215, 217, 235, 237, 240, 249, 250, 252, 257, 258, 259, 260, 264, 265, 266, 268, 270, 271, 275, 289, 290)
---
                $contacts[] = $msg->is_user ? $msg->sender : $msg->contactSender;
            }
        } else {
            $outgoingMessages  = Message::with('recipients.user', 'recipients.contact')
                ->whereIn('organization_id', $myOrgs)
                ->whereHas('recipients', function ($query) use ($myOrgs) {
                    $query->whereNotIn('organization_id', $myOrgs);
                })
                ->where('status', 'sent')
                ->distinct()
                ->get();

select `id` from `folders` where `organization_id` in (188, 189, 190, 192, 193, 194, 195, 214, 253, 343, 403, 11)
---

        //Removes duplicate and changes name key to label key for vue tree select display
        $contacts =  str_replace('name', 'label', (collect($contacts)->unique()->values()->toJSon()));
        $orgsFolder = Folder::whereIn('organization_id', $myOrgs)->pluck('id')->toArray();