app/Http/Livewire/ShowMedia.php

select * from `media` where `collection_name` = 'དཔལ་འབྱོར་ལས་ཁུངས།' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `media` where `collection_name` = 'དཔལ་འབྱོར་ལས་ཁུངས།'
---
    public function render()
    {
        $orgs = [];
        if($this->type === 'shared')
        {
            $media = Media::whereHas('messages', function($query){
                $query->whereRelation('recipients','user_id', auth()->id());
            });
            $orgs = $media->pluck('collection_name')->unique()->toArray();
        }
        else
        {
            if(auth()->user()->hasRole(['admin','front desk']))
            {
                $media = Media::where('collection_name',auth()->user()->organization->name_short);
            }
            else{
                $media = Media::where('model_id',auth()->id());
            }
        }

        $media = $media->when(!empty($this->sharedBy),function($query){
                $query->where('collection_name',$this->sharedBy);
            })
            ->when(!empty($this->year),function($query){
                $query->whereYear('created_at',$this->year);
            })
            ->when(!empty($this->month),function($query){
                $query->whereMonth('created_at',$this->month);
            })
            ->orderBy('created_at',$this->sort)
            ->paginate(10);