app/Http/Controllers/DashboardController.php

    public function __invoke()
    {
        $me = auth()->user();
        $mailsSent      = $me->messages()->count();
        $mailsReceived  = $me->recipients()->count();
---
select count(*) as aggregate from `messages` where `messages`.`user_id` = 22 and `messages`.`user_id` is not null
select count(*) as aggregate from `recipients` where `recipients`.`user_id` = 22 and `recipients`.`user_id` is not null