app/Http/Controllers/RecordController.php

    public function create($type)
    {
        $sections = auth()->user()->organization->fullOrganization()->pluck('id')->toArray();

        /*Gets only user which are staff of an organization
        $users = User::whereHas('organization', function (Builder $query) {
                $type = OrgType::whereIn('name_short',['external','individual'])->pluck('id')->toArray();
                $query->whereIn('type_id',$type);
            })->get();x
        */

        //Gets front desk of root organizations
        $frontDesks = User::getFrontDesk()->get();

        //Customizing the label to display
        $frontDesks->each(function ($front) {
            $front->label = $front->label.' ( '.$front->organization->name_short.' )';
            $front->is_colleague = false;
        });

        $fy = fiscalYear();
        $register = $type === 'incoming'
            ?  auth()->user()->organization->getRoot()->registers()->firstOrCreate(
                ['fiscal_year'=>$fy],
                ['incoming_no'=>0, 'outgoing_no'=>0]
            )->incoming_no + 1
            :auth()->user()->organization->getRoot()->registers()->firstOrCreate(
                ['fiscal_year'=>$fy],
                ['incoming_no'=>0, 'outgoing_no'=>0]
            )->outgoing_no + 1;

        $messageTypes = MessageType::get();
---
select * from `registers` where `registers`.`organization_id` = 11 and `registers`.`organization_id` is not null and (`fiscal_year` = '2025 - 2026') limit 1
select * from `message_type`