app/Models/Folder.php

    public function getFolderTree($orgs)
    {
        $folders = Folder::select('id','file_no as label','name')
            ->with('subfolders')
            ->withCount('subfolders')
            ->whereIn('organization_id',$orgs)
            ->whereNull('parent_id')
            ->get();
---
select * from `folders` where `folders`.`parent_id` in (620, 667, 668, 669, 670, 671, 672, 673, 1908, 2567, 3372, 3373, 3374, 3375, 3376, 3488, 8692)