app/Models/OrganizationHierarchy.php

select `id`, `name_short`, `name` from `organization_hierarchies` where `id` = 11 limit 1
---
    public function getOrgChart()
    {
        $tree = $this->select('id','name_short','name')
            ->where('id',$this->id)
            ->first();