app/Models/User.php

    public function unreadMessagesCount(): int
    {
        return DB::table('recipients')
            ->join('messages', 'recipients.message_id', '=', 'messages.id')
            ->join('users', 'recipients.user_id', '=', 'users.id')
            ->where('users.id', '=', $this->id)
            ->where('messages.status', '=', 'sent')
            ->whereNull('recipients.last_read')->count();
---
select count(*) as aggregate from `recipients` inner join `messages` on `recipients`.`message_id` = `messages`.`id` inner join `users` on `recipients`.`user_id` = `users`.`id` where `users`.`id` = 30 and `messages`.`status` = 'sent' and `recipients`.`last_read` is null